In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
test_set = pd.read_excel('Final_Test.xlsx')
train_set = pd.read_excel('Final_Train.xlsx')

In [3]:
train_set.info()
print('-'*40)
test_set.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5961 entries, 0 to 5960
Data columns (total 7 columns):
Qualification         5961 non-null object
Experience            5961 non-null object
Rating                2659 non-null object
Place                 5936 non-null object
Profile               5961 non-null object
Miscellaneous_Info    3341 non-null object
Fees                  5961 non-null int64
dtypes: int64(1), object(6)
memory usage: 326.1+ KB
----------------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1987 entries, 0 to 1986
Data columns (total 6 columns):
Qualification         1987 non-null object
Experience            1987 non-null object
Rating                897 non-null object
Place                 1981 non-null object
Profile               1987 non-null object
Miscellaneous_Info    1153 non-null object
dtypes: object(6)
memory usage: 93.2+ KB

In [4]:
train_set.head(6)

,Qualification,Experience,Rating,Place,Profile,Miscellaneous_Info,Fees
0,"BHMS, MD - Homeopathy",24 years experience,100%,"Kakkanad, Ernakulam",Homeopath,"100% 16 Feedback Kakkanad, Ernakulam",100
1,"BAMS, MD - Ayurveda Medicine",12 years experience,98%,"Whitefield, Bangalore",Ayurveda,"98% 76 Feedback Whitefield, Bangalore",350
2,"MBBS, MS - Otorhinolaryngology",9 years experience,NaN,"Mathikere - BEL, Bangalore",ENT Specialist,NaN,300
3,"BSc - Zoology, BAMS",12 years experience,NaN,"Bannerghatta Road, Bangalore",Ayurveda,"Bannerghatta Road, Bangalore ₹250 Available on...",250
4,BAMS,20 years experience,100%,"Keelkattalai, Chennai",Ayurveda,"100% 4 Feedback Keelkattalai, Chennai",250
5,BAMS,8 years experience,NaN,"Porur, Chennai",Ayurveda,NaN,100

In [5]:
test_set.head()

,Qualification,Experience,Rating,Place,Profile,Miscellaneous_Info
0,MBBS,35 years experience,NaN,"Ghatkopar East, Mumbai",General Medicine,NaN
1,"MBBS, Diploma in Otorhinolaryngology (DLO)",31 years experience,NaN,"West Marredpally, Hyderabad",ENT Specialist,NaN
2,"MBBS, DDVL",40 years experience,70%,"KK Nagar, Chennai",Dermatologists,"70% 4 Feedback KK Nagar, Chennai"
3,BAMS,0 years experience,NaN,"New Ashok Nagar, Delhi",Ayurveda,NaN
4,"BDS, MDS - Conservative Dentistry & Endodontics",16 years experience,100%,"Kanakpura Road, Bangalore",Dentist,General Dentistry Conservative Dentistry Cosme...

In [6]:
print('Training set Analysis \n','-'*50)
print('Columns Names : ', train_set.columns)
print('\n No of Columns : ', len(train_set.columns))
print('\n No of Empty Columns :\n \n', train_set.isnull().sum() )
print('\n Dataset Size : ', len(train_set))

Training set Analysis
 --------------------------------------------------
Columns Names :  Index(['Qualification', 'Experience', 'Rating', 'Place', 'Profile',
       'Miscellaneous_Info', 'Fees'],
      dtype='object')

 No of Columns :  7

 No of Empty Columns :

 Qualification            0
Experience               0
Rating                3302
Place                   25
Profile                  0
Miscellaneous_Info    2620
Fees                     0
dtype: int64

 Dataset Size :  5961

In [7]:
print('Testing set Analysis \n ','-'*50)
print('Columns Names : ', test_set.columns)
print('\n No of Columns : ', len(test_set.columns))
print('\n No of Empty Columns :\n \n', test_set.isnull().sum() )
print('\n Dataset Size : ', len(test_set))

Testing set Analysis
  --------------------------------------------------
Columns Names :  Index(['Qualification', 'Experience', 'Rating', 'Place', 'Profile',
       'Miscellaneous_Info'],
      dtype='object')

 No of Columns :  6

 No of Empty Columns :

 Qualification            0
Experience               0
Rating                1090
Place                    6
Profile                  0
Miscellaneous_Info     834
dtype: int64

 Dataset Size :  1987

In [8]:
train_set['Year_of_Exp'] = train_set['Experience'].str.extract(r'^(\d+)', expand=False)
train_set = train_set.drop(columns = ['Experience'])

train_set['Rating'] = train_set['Rating'].str.extract(r'^(\d+)', expand=False)
train_set['Rating'].fillna('-1', inplace= True)

train_set['Place'].fillna('Unknown', inplace= True)
train_set['Place']=train_set['Place'].str.split(", ") 
  
train_set['Location']=train_set['Place'].str[0] 
train_set['City']=train_set['Place'].str[-1]
train_set.loc[train_set['City'] == 'e']
train_set['City'][3980]= 'Unknown'
train_set = train_set.drop(columns = ['Place'])

C:\Users\avani\Anaconda\lib\site-packages\ipykernel_launcher.py:13: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  del sys.path[0]

In [9]:
print(train_set['Rating'].unique())

Rate = []
for i in train_set['Rating']:
    if i>='90':
        Rate.append('95')
    elif i>='80' and i<'90':
        Rate.append('85')
    elif i>='70' and i<'80':
        Rate.append('75')
    elif i>='60' and i<'70':
        Rate.append('65')
    elif i>='50' and i<'60':
        Rate.append('55')
    elif i>='40' and i<'50':
        Rate.append('45')
    elif i>='30' and i<'40':
        Rate.append('35')
    elif i>='20' and i<'30':
        Rate.append('25')
    elif i>='10' and i<'20':
        Rate.append('15')
    elif i>='0' and i<'10':
        Rate.append('5')
    else:
        Rate.append('-1')
train_set['Rating']=Rate

['100' '98' '-1' '99' '79' '95' '97' '94' '88' '90' '80' '93' '36' '78'
 '87' '96' '82' '89' '74' '86' '92' '83' '76' '85' '56' '91' '68' '60'
 '75' '69' '73' '67' '77' '33' '55' '71' '84' '45' '63' '72' '81' '62'
 '57' '7' '48' '40' '70' '64' '65' '47' '58' '53']

In [10]:
train_set['Qualification']=train_set['Qualification'].str.split(", ") 
  
train_set['Quali_1']=train_set['Qualification'].str[0] 
train_set['Quali_2']=train_set['Qualification'].str[1] 
train_set['Quali_3']=train_set['Qualification'].str[2] 

train_set['Quali_2'].fillna('Unavailable', inplace= True)
train_set['Quali_3'].fillna('Unavailable', inplace= True)

train_set=train_set.drop(columns = ['Qualification'])

In [11]:
train_set.head()

,Rating,Profile,Miscellaneous_Info,Fees,Year_of_Exp,Location,City,Quali_1,Quali_2,Quali_3
0,15,Homeopath,"100% 16 Feedback Kakkanad, Ernakulam",100,24,Kakkanad,Ernakulam,BHMS,MD - Homeopathy,Unavailable
1,95,Ayurveda,"98% 76 Feedback Whitefield, Bangalore",350,12,Whitefield,Bangalore,BAMS,MD - Ayurveda Medicine,Unavailable
2,-1,ENT Specialist,NaN,300,9,Mathikere - BEL,Bangalore,MBBS,MS - Otorhinolaryngology,Unavailable
3,-1,Ayurveda,"Bannerghatta Road, Bangalore ₹250 Available on...",250,12,Bannerghatta Road,Bangalore,BSc - Zoology,BAMS,Unavailable
4,15,Ayurveda,"100% 4 Feedback Keelkattalai, Chennai",250,20,Keelkattalai,Chennai,BAMS,Unavailable,Unavailable

In [12]:
test_set['Years_of_Experience'] = test_set['Experience'].str.extract(r'^(\d+)', expand=False)
test_set = test_set.drop(columns = ['Experience'])

test_set['Rating'] = test_set['Rating'].str.extract(r'^(\d+)', expand=False)
test_set['Rating'].fillna('-1', inplace= True)

test_set['Place'].fillna('Unknown', inplace= True) 
test_set['Place']= test_set['Place'].str.split(", ", 1)
  
test_set['Location']=test_set['Place'].str.get(0) 
test_set['City']=test_set['Place'] .str.get(1) 
test_set['City'].fillna('Unknown', inplace = True)
test_set = test_set.drop(columns = ['Place'])

In [13]:
print(test_set['Rating'].unique())

Rate = []
for i in test_set['Rating']:
    if i>='90':
        Rate.append('95')
    elif i>='80' and i<'90':
        Rate.append('85')
    elif i>='70' and i<'80':
        Rate.append('75')
    elif i>='60' and i<'70':
        Rate.append('65')
    elif i>='50' and i<'60':
        Rate.append('55')
    else:
        Rate.append('-1')
test_set['Rating']=Rate

['-1' '70' '100' '90' '94' '99' '98' '87' '64' '96' '95' '97' '93' '69'
 '71' '83' '92' '80' '86' '88' '67' '85' '84' '55' '89' '82' '81' '60'
 '73' '65' '77' '91' '78' '79' '76' '52' '53']

In [14]:
test_set['Qualification']=test_set['Qualification'].str.split(", ") 
  
test_set['Quali_1']=test_set['Qualification'].str[0] 
test_set['Quali_2']=test_set['Qualification'].str[1] 
test_set['Quali_3']=test_set['Qualification'].str[2] 

test_set['Quali_2'].fillna('Unavailable', inplace= True)
test_set['Quali_3'].fillna('Unavailable', inplace= True)

test_set=test_set.drop(columns = ['Qualification'])

In [15]:
test_set.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1987 entries, 0 to 1986
Data columns (total 9 columns):
Rating                 1987 non-null object
Profile                1987 non-null object
Miscellaneous_Info     1153 non-null object
Years_of_Experience    1987 non-null object
Location               1987 non-null object
City                   1987 non-null object
Quali_1                1987 non-null object
Quali_2                1987 non-null object
Quali_3                1987 non-null object
dtypes: object(9)
memory usage: 139.8+ KB

In [19]:
X_train = train_set.drop(columns = ['Fees','Miscellaneous_Info'])
y_train = train_set['Fees']

X_test = test_set.drop(columns = ['Miscellaneous_Info'])

In [20]:
X_train.shape , y_train.shape , X_test.shape

((5961, 8), (5961,), (1987, 8))

In [21]:
X_train['Quali_1'] = pd.factorize(X_train['Quali_1'])[0] 
X_train['Quali_2'] = pd.factorize(X_train['Quali_2'])[0] 
X_train['Quali_3'] = pd.factorize(X_train['Quali_3'])[0] 
X_train['Profile']= pd.factorize(X_train['Profile'])[0]
X_train['Location']= pd.factorize(X_train['Location'])[0]
X_train['City']= pd.factorize(X_train['City'])[0]

X_train.head()

  Rating  Profile Year_of_Exp  Location  City  Quali_1  Quali_2  Quali_3
0     15        0          24         0     0        0        0        0
1     95        1          12         1     1        1        1        0
2     -1        2           9         2     1        2        2        0
3     -1        1          12         3     1        3        3        0
4     15        1          20         4     2        1        4        0

In [23]:
X_test['Quali_1'] = pd.factorize(X_test['Quali_1'])[0]
X_test['Quali_2'] = pd.factorize(X_test['Quali_2'])[0]
X_test['Quali_3'] = pd.factorize(X_test['Quali_3'])[0]
X_test['Profile']= pd.factorize(X_test['Profile'])[0]
X_test['Location']= pd.factorize(X_test['Location'])[0]
X_test['City']= pd.factorize(X_test['City'])[0]

X_test.head()

,Rating,Profile,Years_of_Experience,Location,City,Quali_1,Quali_2,Quali_3
0,-1,0,35,0,0,0,0,0
1,-1,1,31,1,1,0,1,0
2,75,2,40,2,2,0,2,0
3,-1,3,0,3,3,1,0,0
4,-1,4,16,4,4,2,3,0

In [24]:
X_train.info(), X_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5961 entries, 0 to 5960
Data columns (total 8 columns):
Rating         5961 non-null object
Profile        5961 non-null int64
Year_of_Exp    5961 non-null object
Location       5961 non-null int64
City           5961 non-null int64
Quali_1        5961 non-null int64
Quali_2        5961 non-null int64
Quali_3        5961 non-null int64
dtypes: int64(6), object(2)
memory usage: 372.6+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1987 entries, 0 to 1986
Data columns (total 8 columns):
Rating                 1987 non-null object
Profile                1987 non-null int64
Years_of_Experience    1987 non-null object
Location               1987 non-null int64
City                   1987 non-null int64
Quali_1                1987 non-null int64
Quali_2                1987 non-null int64
Quali_3                1987 non-null int64
dtypes: int64(6), object(2)
memory usage: 124.3+ KB

(None, None)

In [25]:
import statsmodels.api as sm
#X_train = sm.add_constant(X_train)
model = sm.OLS(y_train, X_train.astype(int))
model = model.fit()
print(model.summary())

                            OLS Regression Results
==============================================================================
Dep. Variable:                   Fees   R-squared:                       0.677
Model:                            OLS   Adj. R-squared:                  0.676
Method:                 Least Squares   F-statistic:                     1558.
Date:                Wed, 02 Oct 2019   Prob (F-statistic):               0.00
Time:                        21:58:02   Log-Likelihood:                -40217.
No. Observations:                5961   AIC:                         8.045e+04
Df Residuals:                    5953   BIC:                         8.050e+04
Df Model:                           8
Covariance Type:            nonrobust
===============================================================================
                  coef    std err          t      P>|t|      [0.025      0.975]
-------------------------------------------------------------------------------
Rating          0.9887      0.063     15.715      0.000       0.865       1.112
Profile        33.2731      1.510     22.030      0.000      30.312      36.234
Year_of_Exp     3.0522      0.221     13.826      0.000       2.619       3.485
Location        0.0892      0.012      7.376      0.000       0.066       0.113
City           21.0311      1.183     17.782      0.000      18.712      23.350
Quali_1         0.6534      0.151      4.330      0.000       0.358       0.949
Quali_2         0.1819      0.037      4.861      0.000       0.109       0.255
Quali_3         0.1377      0.041      3.363      0.001       0.057       0.218
==============================================================================
Omnibus:                      141.280   Durbin-Watson:                   1.937
Prob(Omnibus):                  0.000   Jarque-Bera (JB):              143.474
Skew:                           0.358   Prob(JB):                     7.00e-32
Kurtosis:                       2.744   Cond. No.                         193.
==============================================================================

Warnings:
[1] Standard Errors assume that the covariance matrix of the errors is correctly specified.

In [26]:
print('Parameters: ', model.params)
print('R2: ', model.rsquared)

Parameters:  Rating          0.988684
Profile        33.273108
Year_of_Exp     3.052198
Location        0.089240
City           21.031092
Quali_1         0.653406
Quali_2         0.181939
Quali_3         0.137749
dtype: float64
R2:  0.6767988804410688